#!/bin/bash
# Проверка корректности количества переданных аргументов
[[ "$#" = 2 || "$#" = 3 ]] || exit 1
# Проверка существования обоих файлов
[[ -f "$1" && -f "$2" ]] || exit 1
# Проверка возможности чтения обоих файлов
[[ -r "$1" && -r "$2" ]] || exit 1
# Корректность ключа verbose
[[ "$#" = 3 && "$3" != "-v" ]] && exit 1
[[ "$#" = 3 && "$3" = "-v" ]] && echo "Дополнительная информация: -"
# Собираем числа из первого файла в первый массив
arrres1=()
i1=0
while read text1; do
	for cell1 in $text1; do
		if [[ "$cell1" =~ ^[+-]?[0-9]+$ ]]; then
			arrres1[$i1]="{$cell1}"
			i1=$(($i1+1))
		elif [[ "$cell1" =~ ^[+-]?[0-9]+[.][0-9]+$ ]]; then
			arrres1[$i1]="{$cell1}"
			i1=$(($i1+1))
		fi
	done
done < $1
# Собираем числа из второго файла во второй массив
arrres2=()
i2=0
while read text2; do
	for cell2 in $text2; do
		if [[ "$cell2" =~ ^[+-]?[0-9]+$ ]]; then
		        arrres2[$i2]="{$cell2}"
		        i2=$(($i2+1))
		elif [[ "$cell2" =~ ^[+-]?[0-9]+[.][0-9]+$ ]]; then
		        arrres2[$i2]="{$cell2}"
		        i2=$(($i2+1))
		fi
	done
done < $2
# Проверяем длины массивов
if  [[ "${#arrres1[@]}" = 0 && "${#arrres2[@]}" = 0 ]]; then
	echo "В обоих текстах нет ни одного числа"
	exit 1
else
	if [[ "${#arrres1[@]}" = 0 ]]; then
		echo "В первом тексте нет ни одного числа"
		exit 1
	elif  [[ "${#arrres2[@]}" = 0 ]]; then
		echo "Во втором тексте нет ни одного числа"
		exit 1
fi
fi
# Длины массивов корректны, проверяем циклом совпадение элементов
if [[ ${#arrres1[@]} != ${#arrres2[@]} ]]; then
	echo "Последовательности чисел в файлах $1 и $2 не совпадают"
	exit 1
else
	for i in ${!arrres1[@]}; do
		if [[ "$arrres1[$i]" != "$arrres2[$i]" ]]; then
			echo "Последовательности чисел в файлах $1 и $2 не совпадают"
			exit 1 
		fi
	done
fi
echo "Последовательности чисел в файлах $1 и $2 совпадают"
exit 0
